{
  "metadata": {
    "name": "Comprehensive Islamic Dua Collection",
    "description": "Extensive collection of authentic duas from Quran and Sunnah including Hisn al-Muslim",
    "version": "2.0",
    "total_categories": 25,
    "total_duas": 89,
    "last_updated": "2025-11-23",
    "sources": [
      "Hisn al-Muslim",
      "Quran",
      "Sahih Bukhari",
      "Sahih Muslim",
      "Abu Dawud",
      "Tirmidhi"
    ]
  },
  "categories": [
    {
      "id": 1,
      "name": "Morning & Evening Adhkar",
      "slug": "morning-evening",
      "icon": "wb_sunny",
      "color": "#FFA726",
      "description": "Daily remembrance for morning and evening protection"
    },
    {
      "id": 2,
      "name": "Salah & Worship",
      "slug": "salah-worship",
      "icon": "mosque",
      "color": "#66BB6A",
      "description": "Duas related to prayer and worship"
    },
    {
      "id": 3,
      "name": "Seeking Forgiveness",
      "slug": "forgiveness",
      "icon": "favorite",
      "color": "#EF5350",
      "description": "Istighfar and repentance duas"
    },
    {
      "id": 4,
      "name": "Protection & Safety",
      "slug": "protection",
      "icon": "shield",
      "color": "#42A5F5",
      "description": "Protection from harm and evil"
    },
    {
      "id": 5,
      "name": "Guidance & Knowledge",
      "slug": "guidance",
      "icon": "school",
      "color": "#AB47BC",
      "description": "Seeking wisdom and guidance"
    },
    {
      "id": 6,
      "name": "Health & Healing",
      "slug": "health",
      "icon": "healing",
      "color": "#26A69A",
      "description": "Duas for health and well-being"
    },
    {
      "id": 7,
      "name": "Provision & Sustenance",
      "slug": "provision",
      "icon": "payments",
      "color": "#FFCA28",
      "description": "Seeking halal provision and blessings"
    },
    {
      "id": 8,
      "name": "Family & Relationships",
      "slug": "family",
      "icon": "family_restroom",
      "color": "#FF7043",
      "description": "Duas for family and relationships"
    },
    {
      "id": 9,
      "name": "Travel & Journey",
      "slug": "travel",
      "icon": "flight",
      "color": "#5C6BC0",
      "description": "Duas for safe travel"
    },
    {
      "id": 10,
      "name": "Gratitude & Praise",
      "slug": "gratitude",
      "icon": "volunteer_activism",
      "color": "#EC407A",
      "description": "Thanking and praising Allah"
    },
    {
      "id": 11,
      "name": "Difficulty & Hardship",
      "slug": "difficulty",
      "icon": "support",
      "color": "#8D6E63",
      "description": "Duas during trials and hardship"
    },
    {
      "id": 12,
      "name": "Sleep & Waking",
      "slug": "sleep",
      "icon": "bedtime",
      "color": "#7E57C2",
      "description": "Bedtime and waking duas"
    },
    {
      "id": 13,
      "name": "Food & Drink",
      "slug": "food",
      "icon": "restaurant",
      "color": "#FF9800",
      "description": "Duas before and after eating"
    },
    {
      "id": 14,
      "name": "Quran Duas",
      "slug": "quran-duas",
      "icon": "menu_book",
      "color": "#00897B",
      "description": "Duas from the Holy Quran"
    },
    {
      "id": 15,
      "name": "Prophet's Duas",
      "slug": "prophets-duas",
      "icon": "star",
      "color": "#FFD700",
      "description": "Duas from Prophet Muhammad ﷺ"
    },
    {
      "id": 16,
      "name": "Entering & Leaving Home",
      "slug": "home",
      "icon": "home",
      "color": "#9C27B0",
      "description": "Duas when entering and leaving home"
    },
    {
      "id": 17,
      "name": "Wudu & Cleanliness",
      "slug": "wudu",
      "icon": "water_drop",
      "color": "#03A9F4",
      "description": "Duas related to wudu and cleanliness"
    },
    {
      "id": 18,
      "name": "Mosque & Masjid",
      "slug": "mosque",
      "icon": "account_balance",
      "color": "#4CAF50",
      "description": "Duas for entering and leaving mosque"
    },
    {
      "id": 19,
      "name": "Weather & Nature",
      "slug": "weather",
      "icon": "cloud",
      "color": "#607D8B",
      "description": "Duas for rain, wind, thunder"
    },
    {
      "id": 20,
      "name": "Death & Funeral",
      "slug": "death",
      "icon": "local_florist",
      "color": "#795548",
      "description": "Duas for the deceased and condolence"
    },
    {
      "id": 21,
      "name": "Marriage & Children",
      "slug": "marriage",
      "icon": "favorite_border",
      "color": "#E91E63",
      "description": "Duas for marriage and children"
    },
    {
      "id": 22,
      "name": "Anger & Patience",
      "slug": "anger",
      "icon": "self_improvement",
      "color": "#FF5722",
      "description": "Duas to control anger and gain patience"
    },
    {
      "id": 23,
      "name": "Debt & Financial Worry",
      "slug": "debt",
      "icon": "account_balance_wallet",
      "color": "#009688",
      "description": "Duas for relief from debt"
    },
    {
      "id": 24,
      "name": "Hajj & Umrah",
      "slug": "hajj",
      "icon": "place",
      "color": "#3F51B5",
      "description": "Duas for pilgrimage"
    },
    {
      "id": 25,
      "name": "General Supplications",
      "slug": "general",
      "icon": "auto_awesome",
      "color": "#FFC107",
      "description": "Comprehensive general duas"
    }
  ],
  "duas": [
    {
      "id": 1,
      "categoryId": 1,
      "title": "Ayatul Kursi",
      "arabic": "اللَّهُ لَا إِلَٰهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ ۚ لَا تَأْخُذُهُ سِنَةٌ وَلَا نَوْمٌ ۚ لَهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الْأَرْضِ ۗ مَنْ ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلَّا بِإِذْنِهِ ۚ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ ۖ وَلَا يُحِيطُونَ بِشَيْءٍ مِنْ عِلْمِهِ إِلَّا بِمَا شَاءَ ۚ وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالْأَرْضَ ۖ وَلَا يَئُودُهُ حِفْظُهُمَا ۚ وَهُوَ الْعَلِيُّ الْعَظِيمُ",
      "transliteration": "Allahu la ilaha illa Huwa, Al-Hayyul-Qayyum. La ta'khudhuhu sinatun wa la nawm. Lahu ma fis-samawati wa ma fil-ard. Man dhal-ladhi yashfa'u 'indahu illa bi-idhnih. Ya'lamu ma bayna aydihim wa ma khalfahum, wa la yuhituna bi shay'im-min 'ilmihi illa bima sha'a. Wasi'a Kursiyyuhus-samawati wal-ard, wa la ya'uduhu hifdhuhuma. Wa Huwal-'Aliyyul-'Adheem.",
      "translation": "Allah! There is no deity except Him, the Ever-Living, the Sustainer of existence. Neither drowsiness overtakes Him nor sleep. To Him belongs whatever is in the heavens and whatever is on the earth. Who is it that can intercede with Him except by His permission? He knows what is before them and what will be after them, and they encompass not a thing of His knowledge except for what He wills. His Kursi extends over the heavens and the earth, and their preservation tires Him not. And He is the Most High, the Most Great.",
      "reference": "Quran 2:255",
      "benefits": "Whoever recites this when he rises in the morning will be protected from jinn until he retires in the evening, and whoever recites it when he retires in the evening will be protected from them until he rises in the morning",
      "time": "Morning & Evening (once)"
    },
    {
      "id": 2,
      "categoryId": 1,
      "title": "Last Two Verses of Surah Al-Baqarah",
      "arabic": "آمَنَ الرَّسُولُ بِمَا أُنزِلَ إِلَيْهِ مِن رَّبِّهِ وَالْمُؤْمِنُونَ ۚ كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِّن رُّسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا ۚ لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ ۗ رَبَّنَا لَا تُؤَاخِذْنَا إِن نَّسِينَا أَوْ أَخْطَأْنَا ۚ رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِن قَبْلِنَا ۚ رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      "transliteration": "Amana ar-Rasulu bima unzila ilayhi min Rabbihi wal-mu'minun. Kullun amana billahi wa mala'ikatihi wa kutubihi wa Rusulihi la nufarriqu bayna ahadin min Rusulihi wa qalu sami'na wa ata'na ghufranaka Rabbana wa ilaykal-masir. La yukallifu Allahu nafsan illa wus'aha laha ma kasabat wa 'alayha mak-tasabat. Rabbana la tu'akhidhna in nasina aw akhta'na. Rabbana wa la tahmil 'alayna isran kama hamaltahu 'ala alladhina min qablina. Rabbana wa la tuhammilna ma la taqata lana bihi wa'fu 'anna waghfir lana warhamna anta mawlana fansurna 'alal-qawmil-kafirin.",
      "translation": "The Messenger has believed in what was revealed to him from his Lord, and [so have] the believers. All of them have believed in Allah and His angels and His books and His messengers, [saying], 'We make no distinction between any of His messengers.' And they say, 'We hear and we obey. [We seek] Your forgiveness, our Lord, and to You is the [final] destination.' Allah does not charge a soul except [with that within] its capacity. It will have [the consequence of] what [good] it has gained, and it will bear [the consequence of] what [evil] it has earned. 'Our Lord, do not impose blame upon us if we have forgotten or erred. Our Lord, and lay not upon us a burden like that which You laid upon those before us. Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.'",
      "reference": "Quran 2:285-286",
      "benefits": "Whoever recites these two verses at night, they will be sufficient for him",
      "time": "Evening (once)"
    },
    {
      "id": 3,
      "categoryId": 1,
      "title": "Surah Al-Ikhlas",
      "arabic": "قُلْ هُوَ اللَّهُ أَحَدٌ، اللَّهُ الصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُ كُفُوًا أَحَدٌ",
      "transliteration": "Qul Huwa Allahu Ahad, Allahu as-Samad, lam yalid wa lam yulad, wa lam yakun lahu kufuwan ahad.",
      "translation": "Say: He is Allah, the One. Allah, the Eternal Refuge. He neither begets nor is born, nor is there to Him any equivalent.",
      "reference": "Quran 112:1-4",
      "benefits": "Equivalent to one-third of the Quran. Protection from all evil",
      "time": "Morning & Evening (3 times)"
    },
    {
      "id": 4,
      "categoryId": 1,
      "title": "Surah Al-Falaq",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ الْفَلَقِ، مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ النَّفَّاثَاتِ فِي الْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ",
      "transliteration": "Qul a'udhu bi-Rabbi al-Falaq, min sharri ma khalaq, wa min sharri ghasiqin idha waqab, wa min sharri an-naffathati fil-'uqad, wa min sharri hasidin idha hasad.",
      "translation": "Say: I seek refuge in the Lord of daybreak, from the evil of that which He created, and from the evil of darkness when it settles, and from the evil of the blowers in knots, and from the evil of an envier when he envies.",
      "reference": "Quran 113:1-5",
      "benefits": "Complete protection from all types of evil and harm",
      "time": "Morning & Evening (3 times)"
    },
    {
      "id": 5,
      "categoryId": 1,
      "title": "Surah An-Nas",
      "arabic": "قُلْ أَعُوذُ بِرَبِّ النَّاسِ، مَلِكِ النَّاسِ، إِلَٰهِ النَّاسِ، مِن شَرِّ الْوَسْوَاسِ الْخَنَّاسِ، الَّذِي يُوَسْوِسُ فِي صُدُورِ النَّاسِ، مِنَ الْجِنَّةِ وَالنَّاسِ",
      "transliteration": "Qul a'udhu bi-Rabbi an-Nas, Maliki an-Nas, Ilahi an-Nas, min sharri al-waswasi al-khannas, alladhi yuwaswisu fi suduri an-nas, min al-jinnati wan-nas.",
      "translation": "Say: I seek refuge in the Lord of mankind, the Sovereign of mankind, the God of mankind, from the evil of the retreating whisperer, who whispers [evil] into the breasts of mankind, from among the jinn and mankind.",
      "reference": "Quran 114:1-6",
      "benefits": "Protection from evil whispers of Shaytan and evil jinn",
      "time": "Morning & Evening (3 times)"
    },
    {
      "id": 6,
      "categoryId": 1,
      "title": "Morning Tasbih",
      "arabic": "سُبْحَانَ اللَّهِ وَبِحَمْدِهِ",
      "transliteration": "Subhan Allahi wa bihamdihi",
      "translation": "Glory is to Allah and praise is to Him",
      "reference": "Bukhari 6406, Muslim 2691",
      "benefits": "Whoever says this 100 times in the morning and evening, none will bring better than this except one who says the same or does more",
      "time": "Morning & Evening (100 times)"
    },
    {
      "id": 7,
      "categoryId": 1,
      "title": "The Master of Seeking Forgiveness (Sayyid al-Istighfar)",
      "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَٰهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَىٰ عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي، فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "transliteration": "Allahumma anta Rabbi la ilaha illa anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu, a'udhu bika min sharri ma sana'tu, abu'u laka bini'matika 'alayya, wa abu'u bidhanbi faghfir li, fa innahu la yaghfiru adh-dhunuba illa anta.",
      "translation": "O Allah, You are my Lord, there is no deity except You. You created me and I am Your servant, and I am faithful to my covenant and my promise as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for verily none can forgive sins except You.",
      "reference": "Bukhari 6306",
      "benefits": "Whoever says this with firm conviction in the evening and dies that night will enter Paradise, and whoever says it in the morning with firm conviction and dies that day will enter Paradise",
      "time": "Morning & Evening (once)"
    },
    {
      "id": 8,
      "categoryId": 1,
      "title": "Morning Protection Dua",
      "arabic": "أَصْبَحْنَا وَأَصْبَحَ الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَٰذَا الْيَوْمِ وَخَيْرَ مَا بَعْدَهُ، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَٰذَا الْيَوْمِ وَشَرِّ مَا بَعْدَهُ، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
      "transliteration": "Asbahna wa asbahal-mulku lillah, walhamdu lillah, la ilaha illallahu wahdahu la sharika lah, lahul-mulku wa lahul-hamd, wa Huwa 'ala kulli shay'in Qadir. Rabbi as'aluka khayra ma fi hadhal-yawm, wa khayra ma ba'dah, wa a'udhu bika min sharri ma fi hadhal-yawm, wa sharri ma ba'dah. Rabbi a'udhu bika minal-kasal, wa su'il-kibar. Rabbi a'udhu bika min 'adhabin fin-nar, wa 'adhabin fil-qabr.",
      "translation": "We have entered a new day and with it all dominion is Allah's. Praise is to Allah. None has the right to be worshipped but Allah alone, Who has no partner. To Allah belongs the dominion, and to Him is the praise, and He is Able to do all things. My Lord, I ask You for the goodness of this day and the goodness that follows it, and I seek refuge in You from the evil of this day and the evil that follows it. My Lord, I seek refuge in You from laziness and helpless old age. My Lord, I seek refuge in You from the punishment of the Fire and the punishment of the grave.",
      "reference": "Muslim 2723",
      "benefits": "Comprehensive morning protection from all evil",
      "time": "Morning (once)"
    },
    {
      "id": 9,
      "categoryId": 1,
      "title": "Evening Protection Dua",
      "arabic": "أَمْسَيْنَا وَأَمْسَى الْمُلْكُ لِلَّهِ، وَالْحَمْدُ لِلَّهِ، لَا إِلَٰهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَىٰ كُلِّ شَيْءٍ قَدِيرٌ، رَبِّ أَسْأَلُكَ خَيْرَ مَا فِي هَٰذِهِ اللَّيْلَةِ وَخَيْرَ مَا بَعْدَهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فِي هَٰذِهِ اللَّيْلَةِ وَشَرِّ مَا بَعْدَهَا، رَبِّ أَعُوذُ بِكَ مِنَ الْكَسَلِ وَسُوءِ الْكِبَرِ، رَبِّ أَعُوذُ بِكَ مِنْ عَذَابٍ فِي النَّارِ وَعَذَابٍ فِي الْقَبْرِ",
      "transliteration": "Amsayna wa amsal-mulku lillah, walhamdu lillah, la ilaha illallahu wahdahu la sharika lah, lahul-mulku wa lahul-hamd, wa Huwa 'ala kulli shay'in Qadir. Rabbi as'aluka khayra ma fi hadhihil-laylah, wa khayra ma ba'daha, wa a'udhu bika min sharri ma fi hadhihil-laylah, wa sharri ma ba'daha. Rabbi a'udhu bika minal-kasal, wa su'il-kibar. Rabbi a'udhu bika min 'adhabin fin-nar, wa 'adhabin fil-qabr.",
      "translation": "We have entered the evening and with it all dominion is Allah's. Praise is to Allah. None has the right to be worshipped but Allah alone, Who has no partner. To Allah belongs the dominion, and to Him is the praise, and He is Able to do all things. My Lord, I ask You for the goodness of this night and the goodness that follows it, and I seek refuge in You from the evil of this night and the evil that follows it. My Lord, I seek refuge in You from laziness and helpless old age. My Lord, I seek refuge in You from the punishment of the Fire and the punishment of the grave.",
      "reference": "Muslim 2723",
      "benefits": "Comprehensive evening protection from all evil",
      "time": "Evening (once)"
    },
    {
      "id": 10,
      "categoryId": 1,
      "title": "Seeking Allah's Pleasure",
      "arabic": "رَضِيتُ بِاللَّهِ رَبًّا، وَبِالْإِسْلَامِ دِينًا، وَبِمُحَمَّدٍ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ نَبِيًّا",
      "transliteration": "Raditu billahi Rabban, wa bil-Islami dinan, wa bi-Muhammadin (sallallahu 'alayhi wa sallam) nabiyyan.",
      "translation": "I am pleased with Allah as my Lord, with Islam as my religion, and with Muhammad (peace be upon him) as my Prophet.",
      "reference": "Abu Dawud 1529, Tirmidhi 3389",
      "benefits": "Paradise becomes obligatory for whoever says this",
      "time": "Morning & Evening (3 times)"
    },
    {
      "id": 4,
      "categoryId": 3,
      "title": "Sayyidul Istighfar (Master of Seeking Forgiveness)",
      "arabic": "اللَّهُمَّ أَنْتَ رَبِّي لَا إِلَهَ إِلَّا أَنْتَ، خَلَقْتَنِي وَأَنَا عَبْدُكَ، وَأَنَا عَلَى عَهْدِكَ وَوَعْدِكَ مَا اسْتَطَعْتُ، أَعُوذُ بِكَ مِنْ شَرِّ مَا صَنَعْتُ، أَبُوءُ لَكَ بِنِعْمَتِكَ عَلَيَّ، وَأَبُوءُ بِذَنْبِي فَاغْفِرْ لِي فَإِنَّهُ لَا يَغْفِرُ الذُّنُوبَ إِلَّا أَنْتَ",
      "transliteration": "Allahumma Anta Rabbi, la ilaha illa Anta, khalaqtani wa ana 'abduka, wa ana 'ala 'ahdika wa wa'dika mastata'tu. A'udhu bika min sharri ma sana'tu, abu'u laka bi ni'matika 'alayya, wa abu'u bi dhanbi, faghfir li fa innahu la yaghfirudh-dhunuba illa Anta.",
      "translation": "O Allah, You are my Lord, there is no deity except You. You created me and I am Your servant, and I am faithful to my covenant and my promise as much as I can. I seek refuge in You from the evil of what I have done. I acknowledge Your favor upon me and I acknowledge my sin, so forgive me, for verily none can forgive sins except You.",
      "reference": "Sahih al-Bukhari 6306",
      "benefits": "Whoever says it during the day with firm faith and dies on that day before evening will be from the people of Paradise",
      "time": "Morning & Evening"
    },
    {
      "id": 5,
      "categoryId": 4,
      "title": "Protection from All Harm",
      "arabic": "بِسْمِ اللَّهِ الَّذِي لَا يَضُرُّ مَعَ اسْمِهِ شَيْءٌ فِي الْأَرْضِ وَلَا فِي السَّمَاءِ وَهُوَ السَّمِيعُ الْعَلِيمُ",
      "transliteration": "Bismillahil-ladhi la yadurru ma'asmihi shay'un fil-ardi wa la fis-sama'i, wa Huwas-Sami'ul-'Alim.",
      "translation": "In the Name of Allah, with Whose Name nothing can harm in the earth nor in the heaven, and He is the All-Hearing, the All-Knowing.",
      "reference": "Abu Dawud 5088, At-Tirmidhi 3388",
      "benefits": "Nothing will harm you (3 times morning and evening)",
      "time": "Morning & Evening"
    },
    {
      "id": 6,
      "categoryId": 5,
      "title": "Dua for Beneficial Knowledge",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا",
      "transliteration": "Allahumma inni as'aluka 'ilman nafi'a, wa rizqan tayyiba, wa 'amalan mutaqabbala.",
      "translation": "O Allah, I ask You for beneficial knowledge, goodly provision, and acceptable deeds.",
      "reference": "Ibn Majah 925",
      "benefits": "Seeking beneficial knowledge and halal provision",
      "time": "After Fajr prayer"
    },
    {
      "id": 7,
      "categoryId": 14,
      "title": "Dua for Guidance (Rabbana Dua)",
      "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar.",
      "translation": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire.",
      "reference": "Quran 2:201",
      "benefits": "Comprehensive dua for this life and the hereafter",
      "time": "Anytime"
    },
    {
      "id": 8,
      "categoryId": 14,
      "title": "Dua for Patience and Steadfastness",
      "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا وَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      "transliteration": "Rabbana afrigh 'alayna sabran wa thabbit aqdamana wansurna 'alal-qawmil-kafirin.",
      "translation": "Our Lord, pour upon us patience and plant firmly our feet and give us victory over the disbelieving people.",
      "reference": "Quran 2:250",
      "benefits": "Seeking patience and steadfastness in faith",
      "time": "During difficulty"
    },
    {
      "id": 9,
      "categoryId": 8,
      "title": "Dua for Righteous Offspring",
      "arabic": "رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ",
      "transliteration": "Rabbi hab li min ladunka dhurriyyatan tayyibatan innaka sami'ud-du'a.",
      "translation": "My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication.",
      "reference": "Quran 3:38",
      "benefits": "Asking for righteous children",
      "time": "Anytime"
    },
    {
      "id": 10,
      "categoryId": 8,
      "title": "Dua for Spouse and Children",
      "arabic": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ وَاجْعَلْنَا لِلْمُتَّقِينَ إِمَامًا",
      "transliteration": "Rabbana hab lana min azwajina wa dhurriyyatina qurrata a'yunin waj'alna lil-muttaqina imama.",
      "translation": "Our Lord, grant us from among our wives and offspring comfort to our eyes and make us an example for the righteous.",
      "reference": "Quran 25:74",
      "benefits": "For blessed family life",
      "time": "Anytime"
    },
    {
      "id": 11,
      "categoryId": 6,
      "title": "Dua for Healing",
      "arabic": "اللَّهُمَّ رَبَّ النَّاسِ، أَذْهِبِ الْبَأْسَ، اشْفِ أَنْتَ الشَّافِي، لَا شِفَاءَ إِلَّا شِفَاؤُكَ، شِفَاءً لَا يُغَادِرُ سَقَمًا",
      "transliteration": "Allahumma Rabban-nas, adhhibil-ba's, ishfi Antash-Shafi, la shifa'a illa shifa'uka, shifaan la yughadiru saqama.",
      "translation": "O Allah, Lord of mankind, remove the harm and heal, You are the Healer. There is no healing except Your healing, a healing that leaves no illness.",
      "reference": "Sahih al-Bukhari 5675",
      "benefits": "For healing from illness",
      "time": "When sick or visiting the sick"
    },
    {
      "id": 12,
      "categoryId": 7,
      "title": "Dua for Halal Provision",
      "arabic": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      "transliteration": "Allahummak-fini bi-halalika 'an haramika, wa aghnini bi-fadlika 'amman siwak.",
      "translation": "O Allah, make what You have made lawful enough for me, as opposed to what You have made unlawful, and spare me by Your grace, of need of others.",
      "reference": "At-Tirmidhi 3563",
      "benefits": "Seeking halal sustenance",
      "time": "Anytime"
    },
    {
      "id": 13,
      "categoryId": 9,
      "title": "Dua When Leaving Home",
      "arabic": "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "transliteration": "Bismillah, tawakkaltu 'alallah, wa la hawla wa la quwwata illa billah.",
      "translation": "In the Name of Allah, I have placed my trust in Allah, there is no might and no power except by Allah.",
      "reference": "Abu Dawud 5095",
      "benefits": "You will be guided, defended and protected",
      "time": "When leaving home"
    },
    {
      "id": 14,
      "categoryId": 9,
      "title": "Dua for Travel",
      "arabic": "سُبْحَانَ الَّذِي سَخَّرَ لَنَا هَذَا وَمَا كُنَّا لَهُ مُقْرِنِينَ، وَإِنَّا إِلَى رَبِّنَا لَمُنْقَلِبُونَ",
      "transliteration": "Subhanal-ladhi sakhkhara lana hadha wa ma kunna lahu muqrinin, wa inna ila Rabbina lamunqalibun.",
      "translation": "Glory be to Him Who has subjected this to us, and we could never have it (by our efforts). And verily, to Our Lord we indeed are to return!",
      "reference": "Abu Dawud 2602",
      "benefits": "Safe journey",
      "time": "When starting a journey"
    },
    {
      "id": 15,
      "categoryId": 12,
      "title": "Dua Before Sleep",
      "arabic": "بِاسْمِكَ اللَّهُمَّ أَمُوتُ وَأَحْيَا",
      "transliteration": "Bismika Allahumma amutu wa ahya.",
      "translation": "In Your Name, O Allah, I die and I live.",
      "reference": "Sahih al-Bukhari 6312",
      "benefits": "Protection during sleep",
      "time": "Before sleeping"
    },
    {
      "id": 16,
      "categoryId": 12,
      "title": "Dua Upon Waking",
      "arabic": "الْحَمْدُ لِلَّهِ الَّذِي أَحْيَانَا بَعْدَ مَا أَمَاتَنَا وَإِلَيْهِ النُّشُورُ",
      "transliteration": "Alhamdu lillahil-ladhi ahyana ba'da ma amatana wa ilayhin-nushur.",
      "translation": "All praise is to Allah who gave us life after having taken it from us and unto Him is the resurrection.",
      "reference": "Sahih al-Bukhari 6312",
      "benefits": "Gratitude for new day",
      "time": "Upon waking"
    },
    {
      "id": 17,
      "categoryId": 13,
      "title": "Dua Before Eating",
      "arabic": "بِسْمِ اللَّهِ",
      "transliteration": "Bismillah.",
      "translation": "In the Name of Allah.",
      "reference": "Abu Dawud 3767",
      "benefits": "Blessing in food",
      "time": "Before eating"
    },
    {
      "id": 18,
      "categoryId": 13,
      "title": "Dua After Eating",
      "arabic": "الْحَمْدُ لِلَّهِ الَّذِي أَطْعَمَنِي هَذَا وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِنِّي وَلَا قُوَّةٍ",
      "transliteration": "Alhamdu lillahil-ladhi at'amani hadha wa razaqanihi min ghayri hawlin minni wa la quwwah.",
      "translation": "All praise is to Allah Who has given me this food and provided it for me without any might or power from myself.",
      "reference": "Abu Dawud 4023",
      "benefits": "Past sins forgiven",
      "time": "After eating"
    },
    {
      "id": 19,
      "categoryId": 11,
      "title": "Dua During Difficulty",
      "arabic": "لَا إِلَهَ إِلَّا اللَّهُ الْعَظِيمُ الْحَلِيمُ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ الْعَرْشِ الْعَظِيمِ، لَا إِلَهَ إِلَّا اللَّهُ رَبُّ السَّمَوَاتِ وَرَبُّ الْأَرْضِ وَرَبُّ الْعَرْشِ الْكَرِيمِ",
      "transliteration": "La ilaha illallahul-'Adhimul-Halim, la ilaha illallahu Rabbul-'Arshil-'Adhim, la ilaha illallahu Rabbus-samawati wa Rabbul-ardi wa Rabbul-'Arshil-Karim.",
      "translation": "There is no deity except Allah, the Mighty, the Forbearing. There is no deity except Allah, Lord of the Magnificent Throne. There is no deity except Allah, Lord of the heavens and Lord of the earth, and Lord of the Noble Throne.",
      "reference": "Sahih al-Bukhari 6345",
      "benefits": "Relief from distress",
      "time": "During hardship"
    },
    {
      "id": 20,
      "categoryId": 11,
      "title": "Dua of Prophet Yunus (Jonah)",
      "arabic": "لَا إِلَهَ إِلَّا أَنْتَ سُبْحَانَكَ إِنِّي كُنْتُ مِنَ الظَّالِمِينَ",
      "transliteration": "La ilaha illa Anta, Subhanaka, inni kuntu minaz-zalimin.",
      "translation": "There is no deity except You; exalted are You. Indeed, I have been of the wrongdoers.",
      "reference": "Quran 21:87",
      "benefits": "No Muslim calls upon Allah with it for anything except that Allah responds to him",
      "time": "During distress"
    },
    {
      "id": 21,
      "categoryId": 10,
      "title": "Tasbih, Tahmid, Takbir",
      "arabic": "سُبْحَانَ اللَّهِ، وَالْحَمْدُ لِلَّهِ، وَاللَّهُ أَكْبَرُ",
      "transliteration": "Subhanallah, walhamdulillah, wallahu Akbar.",
      "translation": "Glory be to Allah, and praise be to Allah, and Allah is the Greatest.",
      "reference": "Sahih Muslim 2691",
      "benefits": "More beloved to Allah than anything the sun rises upon",
      "time": "Anytime (33 times each after prayer)"
    },
    {
      "id": 22,
      "categoryId": 2,
      "title": "Dua After Adhan",
      "arabic": "اللَّهُمَّ رَبَّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، آتِ مُحَمَّدًا الْوَسِيلَةَ وَالْفَضِيلَةَ، وَابْعَثْهُ مَقَامًا مَحْمُودًا الَّذِي وَعَدْتَهُ",
      "transliteration": "Allahumma Rabba hadhihid-da'watit-tammah, was-salatil-qa'imah, ati Muhammadanil-wasilata wal-fadilah, wab'athhu maqaman mahmudan-il-ladhi wa'adtah.",
      "translation": "O Allah, Lord of this perfect call and established prayer, grant Muhammad the intercession and favor, and raise him to the honored station You have promised him.",
      "reference": "Sahih al-Bukhari 614",
      "benefits": "Intercession of the Prophet will be guaranteed",
      "time": "After Adhan"
    },
    {
      "id": 23,
      "categoryId": 2,
      "title": "Dua After Tashahhud (Before Salam)",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
      "transliteration": "Allahumma inni a'udhu bika min 'adhabi Jahannam, wa min 'adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-Masihid-Dajjal.",
      "translation": "O Allah, I seek refuge in You from the punishment of Hell, from the punishment of the grave, from the trials of life and death, and from the evil of the trial of the False Messiah.",
      "reference": "Sahih al-Bukhari 1377",
      "benefits": "Protection from major trials",
      "time": "In every prayer before salam"
    },
    {
      "id": 24,
      "categoryId": 14,
      "title": "Dua for Increase in Knowledge",
      "arabic": "رَبِّ زِدْنِي عِلْمًا",
      "transliteration": "Rabbi zidni 'ilma.",
      "translation": "My Lord, increase me in knowledge.",
      "reference": "Quran 20:114",
      "benefits": "Seeking increase in beneficial knowledge",
      "time": "Anytime, especially before studying"
    },
    {
      "id": 25,
      "categoryId": 14,
      "title": "Dua for Ease",
      "arabic": "رَبِّ يَسِّرْ وَلَا تُعَسِّرْ",
      "transliteration": "Rabbi yassir wa la tu'assir.",
      "translation": "My Lord, make it easy and do not make it difficult.",
      "reference": "Derived from Hadith",
      "benefits": "Seeking ease in affairs",
      "time": "When facing difficulty"
    },
    {
      "id": 26,
      "categoryId": 3,
      "title": "Simple Istighfar",
      "arabic": "أَسْتَغْفِرُ اللَّهَ",
      "transliteration": "Astaghfirullah.",
      "translation": "I seek forgiveness from Allah.",
      "reference": "Sahih al-Bukhari",
      "benefits": "Seeking Allah's forgiveness for sins",
      "time": "Anytime (100 times daily recommended)"
    },
    {
      "id": 27,
      "categoryId": 3,
      "title": "Complete Istighfar",
      "arabic": "أَسْتَغْفِرُ اللَّهَ الْعَظِيمَ الَّذِي لَا إِلَهَ إِلَّا هُوَ الْحَيُّ الْقَيُّومُ وَأَتُوبُ إِلَيْهِ",
      "transliteration": "Astaghfirullaha al-'Adhim alladhi la ilaha illa Huwa al-Hayyu al-Qayyum wa atubu ilayh.",
      "translation": "I seek forgiveness from Allah the Mighty, Whom there is none worthy of worship except Him, the Living, the Eternal, and I repent to Him.",
      "reference": "Abu Dawud 1517",
      "benefits": "Sins will be forgiven even if one has deserted the battlefield",
      "time": "Anytime"
    },
    {
      "id": 28,
      "categoryId": 10,
      "title": "Alhamdulillah",
      "arabic": "الْحَمْدُ لِلَّهِ",
      "transliteration": "Alhamdulillah.",
      "translation": "All praise is due to Allah.",
      "reference": "Quran & Hadith",
      "benefits": "Fills the scales of good deeds",
      "time": "Anytime"
    },
    {
      "id": 29,
      "categoryId": 10,
      "title": "Complete Praise",
      "arabic": "الْحَمْدُ لِلَّهِ رَبِّ الْعَالَمِينَ",
      "transliteration": "Alhamdulillahi Rabbil-'alamin.",
      "translation": "All praise is due to Allah, Lord of all the worlds.",
      "reference": "Quran 1:2",
      "benefits": "Opening of Surah Al-Fatihah",
      "time": "Anytime"
    },
    {
      "id": 30,
      "categoryId": 2,
      "title": "Dua Between Adhan and Iqamah",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ بِحَقِّ هَذِهِ الدَّعْوَةِ التَّامَّةِ، وَالصَّلَاةِ الْقَائِمَةِ، أَنْ تُصَلِّيَ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ",
      "transliteration": "Allahumma inni as'aluka bi-haqqi hadhihid-da'watit-tammah, was-salatil-qa'imah, an tusalliya 'ala Muhammadin wa 'ala ali Muhammad.",
      "translation": "O Allah, I ask You by the right of this perfect call and the established prayer, to send blessings upon Muhammad and the family of Muhammad.",
      "reference": "Derived from Hadith",
      "benefits": "Dua between Adhan and Iqamah is not rejected",
      "time": "Between Adhan and Iqamah"
    },
    {
      "id": 31,
      "categoryId": 2,
      "title": "Dua After Wudu",
      "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
      "transliteration": "Ashhadu an la ilaha illallahu wahdahu la sharika lah, wa ashhadu anna Muhammadan 'abduhu wa rasuluh.",
      "translation": "I bear witness that there is no deity except Allah alone, without partner, and I bear witness that Muhammad is His servant and Messenger.",
      "reference": "Sahih Muslim 234",
      "benefits": "The eight gates of Paradise will be opened, enter from whichever you wish",
      "time": "After completing wudu"
    },
    {
      "id": 32,
      "categoryId": 9,
      "title": "Dua When Entering a City/Town",
      "arabic": "اللَّهُمَّ رَبَّ السَّمَوَاتِ السَّبْعِ وَمَا أَظْلَلْنَ، وَرَبَّ الْأَرَضِينَ السَّبْعِ وَمَا أَقْلَلْنَ، وَرَبَّ الشَّيَاطِينِ وَمَا أَضْلَلْنَ، وَرَبَّ الرِّيَاحِ وَمَا ذَرَيْنَ، أَسْأَلُكَ خَيْرَ هَذِهِ الْقَرْيَةِ وَخَيْرَ أَهْلِهَا، وَأَعُوذُ بِكَ مِنْ شَرِّهَا وَشَرِّ أَهْلِهَا وَشَرِّ مَا فِيهَا",
      "transliteration": "Allahumma Rabbas-samawatis-sab'i wa ma adhlalna, wa Rabbal-aradinas-sab'i wa ma aqlalna, wa Rabbash-shayatini wa ma adlalna, wa Rabbar-riyahi wa ma dharayna, as'aluka khayra hadhihil-qaryati wa khayra ahliha, wa a'udhu bika min sharriha wa sharri ahliha wa sharri ma fiha.",
      "translation": "O Allah, Lord of the seven heavens and all that they overshadow, Lord of the seven earths and all that they carry, Lord of the devils and all whom they misguide, Lord of the winds and all whom they scatter. I ask You for the goodness of this town and the goodness of its people, and I seek refuge in You from its evil, the evil of its people and the evil that is in it.",
      "reference": "Al-Hakim",
      "benefits": "Protection when entering a new place",
      "time": "When entering a city or town"
    },
    {
      "id": 33,
      "categoryId": 9,
      "title": "Dua When Returning from Travel",
      "arabic": "آيِبُونَ، تَائِبُونَ، عَابِدُونَ، لِرَبِّنَا حَامِدُونَ",
      "transliteration": "Ayibuna, ta'ibuna, 'abiduna, li-Rabbina hamidun.",
      "translation": "We return, repent, worship and praise our Lord.",
      "reference": "Sahih al-Bukhari 2993",
      "benefits": "Gratitude for safe return",
      "time": "When returning from journey"
    },
    {
      "id": 34,
      "categoryId": 13,
      "title": "Dua When Breaking Fast",
      "arabic": "اللَّهُمَّ لَكَ صُمْتُ، وَعَلَى رِزْقِكَ أَفْطَرْتُ",
      "transliteration": "Allahumma laka sumtu, wa 'ala rizqika aftartu.",
      "translation": "O Allah, for You I have fasted and with Your provision I have broken my fast.",
      "reference": "Abu Dawud 2358",
      "benefits": "Accepted dua when breaking fast",
      "time": "When breaking fast"
    },
    {
      "id": 35,
      "categoryId": 13,
      "title": "Dua When Drinking Water",
      "arabic": "الْحَمْدُ لِلَّهِ الَّذِي سَقَانَا عَذْبًا فُرَاتًا بِرَحْمَتِهِ، وَلَمْ يَجْعَلْهُ مِلْحًا أُجَاجًا بِذُنُوبِنَا",
      "transliteration": "Alhamdulillahil-ladhi saqana 'adhban furatan bi-rahmatihi, wa lam yaj'alhu milhan ujajan bi-dhunubina.",
      "translation": "All praise is to Allah Who has given us sweet and pleasant water to drink by His mercy, and did not make it bitter and salty because of our sins.",
      "reference": "Derived from Hadith",
      "benefits": "Gratitude for water",
      "time": "After drinking water"
    },
    {
      "id": 36,
      "categoryId": 4,
      "title": "Protection from Evil Eye",
      "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ مِنْ شَرِّ مَا خَلَقَ",
      "transliteration": "A'udhu bi-kalimatillahit-tammati min sharri ma khalaq.",
      "translation": "I seek refuge in the perfect words of Allah from the evil of what He has created.",
      "reference": "Sahih Muslim 2708",
      "benefits": "Protection from all harm (3 times morning and evening)",
      "time": "Morning & Evening"
    },
    {
      "id": 37,
      "categoryId": 4,
      "title": "Protection from Jinn and Mankind",
      "arabic": "أَعُوذُ بِكَلِمَاتِ اللَّهِ التَّامَّاتِ الَّتِي لَا يُجَاوِزُهُنَّ بَرٌّ وَلَا فَاجِرٌ، مِنْ شَرِّ مَا خَلَقَ وَذَرَأَ وَبَرَأَ، وَمِنْ شَرِّ مَا يَنْزِلُ مِنَ السَّمَاءِ، وَمِنْ شَرِّ مَا يَعْرُجُ فِيهَا، وَمِنْ شَرِّ مَا ذَرَأَ فِي الْأَرْضِ، وَمِنْ شَرِّ مَا يَخْرُجُ مِنْهَا، وَمِنْ شَرِّ فِتَنِ اللَّيْلِ وَالنَّهَارِ، وَمِنْ شَرِّ كُلِّ طَارِقٍ إِلَّا طَارِقًا يَطْرُقُ بِخَيْرٍ يَا رَحْمَنُ",
      "transliteration": "A'udhu bi-kalimatillahit-tammat-illati la yujawizuhunna barrun wa la fajir, min sharri ma khalaqa wa dhara'a wa bara'a, wa min sharri ma yanzilu minas-sama', wa min sharri ma ya'ruju fiha, wa min sharri ma dhara'a fil-ard, wa min sharri ma yakhruju minha, wa min sharri fitanil-layli wan-nahar, wa min sharri kulli tariqin illa tariqan yatruqu bi-khayrin ya Rahman.",
      "translation": "I seek refuge in the perfect words of Allah which neither the righteous nor the wicked can transgress, from the evil of what He has created, made and originated. From the evil of what descends from the sky and the evil of what ascends to it. From the evil of what He has created in the earth and the evil of what comes out of it. From the trials of the night and day, and from every visitor except the visitor that comes with goodness, O Most Merciful.",
      "reference": "Ahmad",
      "benefits": "Comprehensive protection",
      "time": "Evening"
    },
    {
      "id": 38,
      "categoryId": 12,
      "title": "Dua for Good Dreams",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْأَحْلَامِ الْمُزْعِجَةِ، وَمِنَ الشَّيْطَانِ الرَّجِيمِ",
      "transliteration": "Allahumma inni a'udhu bika minal-ahlami al-muz'ijati, wa minash-Shaytanir-rajim.",
      "translation": "O Allah, I seek refuge in You from disturbing dreams and from the accursed Satan.",
      "reference": "Derived from Hadith",
      "benefits": "Protection from nightmares",
      "time": "Before sleep"
    },
    {
      "id": 39,
      "categoryId": 12,
      "title": "Comprehensive Sleep Dua",
      "arabic": "اللَّهُمَّ بِاسْمِكَ أَمُوتُ وَأَحْيَا",
      "transliteration": "Allahumma bismika amutu wa ahya.",
      "translation": "O Allah, in Your Name I die and I live.",
      "reference": "Sahih al-Bukhari 6324",
      "benefits": "Remembering Allah before sleep",
      "time": "Before sleeping"
    },
    {
      "id": 40,
      "categoryId": 5,
      "title": "Dua for Understanding",
      "arabic": "اللَّهُمَّ فَهِّمْنِي",
      "transliteration": "Allahumma fahhimni.",
      "translation": "O Allah, grant me understanding.",
      "reference": "Derived from Hadith",
      "benefits": "Seeking comprehension and wisdom",
      "time": "When studying or learning"
    },
    {
      "id": 41,
      "categoryId": 5,
      "title": "Dua for Guidance to Truth",
      "arabic": "اللَّهُمَّ أَرِنَا الْحَقَّ حَقًّا وَارْزُقْنَا اتِّبَاعَهُ، وَأَرِنَا الْبَاطِلَ بَاطِلًا وَارْزُقْنَا اجْتِنَابَهُ",
      "transliteration": "Allahumma arinal-haqqa haqqan warzuqnat-tiba'ah, wa arinal-batila batilan warzuqnaj-tinabah.",
      "translation": "O Allah, show us the truth as truth and grant us the ability to follow it, and show us falsehood as falsehood and grant us the ability to avoid it.",
      "reference": "Derived from Hadith",
      "benefits": "Clarity in distinguishing right from wrong",
      "time": "Anytime"
    },
    {
      "id": 42,
      "categoryId": 7,
      "title": "Dua for Barakah in Provision",
      "arabic": "اللَّهُمَّ بَارِكْ لَنَا فِيمَا رَزَقْتَنَا",
      "transliteration": "Allahumma barik lana fima razaqtana.",
      "translation": "O Allah, bless us in what You have provided for us.",
      "reference": "Derived from Hadith",
      "benefits": "Seeking blessing in sustenance",
      "time": "Before eating or when receiving provision"
    },
    {
      "id": 43,
      "categoryId": 7,
      "title": "Dua for Debt Relief",
      "arabic": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      "transliteration": "Allahummak-fini bi-halalika 'an haramika, wa aghnini bi-fadlika 'amman siwak.",
      "translation": "O Allah, suffice me with what You have allowed instead of what You have forbidden, and make me independent of all others besides You.",
      "reference": "At-Tirmidhi 3563",
      "benefits": "Relief from debt and financial worry",
      "time": "When in debt or financial difficulty"
    },
    {
      "id": 44,
      "categoryId": 8,
      "title": "Dua for Parents",
      "arabic": "رَبِّ ارْحَمْهُمَا كَمَا رَبَّيَانِي صَغِيرًا",
      "transliteration": "Rabbir-hamhuma kama rabbayani saghira.",
      "translation": "My Lord, have mercy upon them as they brought me up when I was small.",
      "reference": "Quran 17:24",
      "benefits": "Seeking mercy for parents",
      "time": "Anytime"
    },
    {
      "id": 45,
      "categoryId": 8,
      "title": "Dua for Pious Children",
      "arabic": "رَبَّنَا هَبْ لَنَا مِنْ أَزْوَاجِنَا وَذُرِّيَّاتِنَا قُرَّةَ أَعْيُنٍ",
      "transliteration": "Rabbana hab lana min azwajina wa dhurriyyatina qurrata a'yun.",
      "translation": "Our Lord, grant us from among our spouses and offspring comfort to our eyes.",
      "reference": "Quran 25:74",
      "benefits": "Righteous family",
      "time": "Anytime"
    },
    {
      "id": 46,
      "categoryId": 11,
      "title": "Dua for Anxiety Relief",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ",
      "transliteration": "Allahumma inni a'udhu bika minal-hammi wal-hazan, wal-'ajzi wal-kasal, wal-bukhli wal-jubn, wa dala'id-dayn, wa ghalabatir-rijal.",
      "translation": "O Allah, I seek refuge in You from worry and grief, from helplessness and laziness, from cowardice and miserliness, and from being overcome by debt and overpowered by men.",
      "reference": "Sahih al-Bukhari 6369",
      "benefits": "Relief from anxiety and stress",
      "time": "When feeling anxious"
    },
    {
      "id": 47,
      "categoryId": 11,
      "title": "Dua When Facing Calamity",
      "arabic": "إِنَّا لِلَّهِ وَإِنَّا إِلَيْهِ رَاجِعُونَ، اللَّهُمَّ أْجُرْنِي فِي مُصِيبَتِي وَأَخْلِفْ لِي خَيْرًا مِنْهَا",
      "transliteration": "Inna lillahi wa inna ilayhi raji'un. Allahumma'-jurni fi musibati wa akhlif li khayran minha.",
      "translation": "Truly, to Allah we belong and truly, to Him we shall return. O Allah, reward me in my affliction and replace it for me with something better.",
      "reference": "Sahih Muslim 918",
      "benefits": "Allah will replace the loss with something better",
      "time": "When afflicted with calamity"
    },
    {
      "id": 48,
      "categoryId": 6,
      "title": "Ruqyah for Healing",
      "arabic": "بِسْمِ اللَّهِ أَرْقِيكَ، مِنْ كُلِّ شَيْءٍ يُؤْذِيكَ، مِنْ شَرِّ كُلِّ نَفْسٍ أَوْ عَيْنِ حَاسِدٍ، اللَّهُ يَشْفِيكَ، بِسْمِ اللَّهِ أَرْقِيكَ",
      "transliteration": "Bismillahi arqik, min kulli shay'in yu'dhik, min sharri kulli nafsin aw 'ayni hasid, Allahu yashfik, bismillahi arqik.",
      "translation": "In the Name of Allah I perform ruqyah for you, from everything that is harming you, from the evil of every soul or envious eye, may Allah cure you, in the Name of Allah I perform ruqyah for you.",
      "reference": "Sahih Muslim 2186",
      "benefits": "Healing and protection",
      "time": "When sick or for protection"
    },
    {
      "id": 49,
      "categoryId": 6,
      "title": "Dua for Shifa (Cure)",
      "arabic": "اللَّهُمَّ رَبَّ النَّاسِ، مُذْهِبَ الْبَأْسِ، اشْفِ أَنْتَ الشَّافِي، لَا شَافِيَ إِلَّا أَنْتَ",
      "transliteration": "Allahumma Rabban-nas, mudhhibal-ba's, ishfi Antash-Shafi, la shafiya illa Ant.",
      "translation": "O Allah, Lord of mankind, Remover of hardship, cure, for You are the Curer. There is no cure except Your cure.",
      "reference": "Sahih al-Bukhari 5743",
      "benefits": "Seeking cure from illness",
      "time": "When sick"
    },
    {
      "id": 50,
      "categoryId": 14,
      "title": "Dua for Forgiveness of Parents",
      "arabic": "رَبَّنَا اغْفِرْ لِي وَلِوَالِدَيَّ وَلِلْمُؤْمِنِينَ يَوْمَ يَقُومُ الْحِسَابُ",
      "transliteration": "Rabbanagh-fir li wa li-walidayya wa lil-mu'minina yawma yaqumul-hisab.",
      "translation": "Our Lord, forgive me and my parents and the believers the Day the account is established.",
      "reference": "Quran 14:41",
      "benefits": "Seeking forgiveness for self, parents, and believers",
      "time": "Anytime"
    },
    {
      "id": 51,
      "categoryId": 14,
      "title": "Dua for Steadfastness",
      "arabic": "رَبَّنَا لَا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِن لَّدُنكَ رَحْمَةً ۚ إِنَّكَ أَنتَ الْوَهَّابُ",
      "transliteration": "Rabbana la tuzigh qulubana ba'da idh hadaytana wa hab lana min ladunka rahmah, innaka Antal-Wahhab.",
      "translation": "Our Lord, let not our hearts deviate after You have guided us and grant us from Yourself mercy. Indeed, You are the Bestower.",
      "reference": "Quran 3:8",
      "benefits": "Protection from misguidance",
      "time": "Anytime"
    },
    {
      "id": 52,
      "categoryId": 14,
      "title": "Dua for Relief from Burden",
      "arabic": "رَبَّنَا وَلَا تُحَمِّلْنَا مَا لَا طَاقَةَ لَنَا بِهِ ۖ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا ۚ أَنتَ مَوْلَانَا فَانصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ",
      "transliteration": "Rabbana wa la tuhammilna ma la taqata lana bih, wa'fu 'anna waghfir lana warhamna, Anta mawlana fansurna 'alal-qawmil-kafirin.",
      "translation": "Our Lord, and burden us not with that which we have no ability to bear. And pardon us; and forgive us; and have mercy upon us. You are our protector, so give us victory over the disbelieving people.",
      "reference": "Quran 2:286",
      "benefits": "Relief from overwhelming burdens",
      "time": "When feeling overwhelmed"
    },
    {
      "id": 53,
      "categoryId": 15,
      "title": "Prophet's Comprehensive Dua",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ الْهُدَى وَالتُّقَى وَالْعَفَافَ وَالْغِنَى",
      "transliteration": "Allahumma inni as'alukal-huda wat-tuqa wal-'afafa wal-ghina.",
      "translation": "O Allah, I ask You for guidance, piety, chastity and self-sufficiency.",
      "reference": "Sahih Muslim 2721",
      "benefits": "Comprehensive dua for spiritual and worldly needs",
      "time": "Anytime"
    },
    {
      "id": 54,
      "categoryId": 15,
      "title": "Dua for Good Character",
      "arabic": "اللَّهُمَّ اهْدِنِي لِأَحْسَنِ الْأَخْلَاقِ، لَا يَهْدِي لِأَحْسَنِهَا إِلَّا أَنْتَ، وَاصْرِفْ عَنِّي سَيِّئَهَا، لَا يَصْرِفُ عَنِّي سَيِّئَهَا إِلَّا أَنْتَ",
      "transliteration": "Allahummah-dini li-ahsanil-akhlaqi la yahdi li-ahsaniha illa Ant, wasrif 'anni sayyi'aha la yasrifu 'anni sayyi'aha illa Ant.",
      "translation": "O Allah, guide me to the best of characters, for none can guide to the best of them but You. And turn away from me the worst of characters, for none can turn them away from me but You.",
      "reference": "Sahih Muslim 771",
      "benefits": "Improvement of character",
      "time": "In prayer"
    },
    {
      "id": 55,
      "categoryId": 15,
      "title": "Dua for Protection from Trials",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ جَهْدِ الْبَلَاءِ، وَدَرَكِ الشَّقَاءِ، وَسُوءِ الْقَضَاءِ، وَشَمَاتَةِ الْأَعْدَاءِ",
      "transliteration": "Allahumma inni a'udhu bika min jahdil-bala', wa darakish-shaqa', wa su'il-qada', wa shamatatal-a'da'.",
      "translation": "O Allah, I seek refuge in You from the hardship of trials, from being overtaken by misery, from bad decree, and from the gloating of enemies.",
      "reference": "Sahih al-Bukhari 6347",
      "benefits": "Protection from major trials",
      "time": "Anytime"
    },
    {
      "id": 63,
      "categoryId": 16,
      "title": "Dua When Entering Home",
      "arabic": "بِسْمِ اللَّهِ وَلَجْنَا، وَبِسْمِ اللَّهِ خَرَجْنَا، وَعَلَى اللَّهِ رَبِّنَا تَوَكَّلْنَا",
      "transliteration": "Bismillahi walajna, wa bismillahi kharajna, wa 'ala Allahi rabbina tawakkalna",
      "translation": "In the name of Allah we enter, in the name of Allah we leave, and upon Allah our Lord we depend",
      "reference": "Abu Dawud 5096",
      "benefits": "Protection for the home and family, blessings upon entering",
      "time": "When entering home"
    },
    {
      "id": 64,
      "categoryId": 16,
      "title": "Dua When Leaving Home",
      "arabic": "بِسْمِ اللَّهِ، تَوَكَّلْتُ عَلَى اللَّهِ، وَلَا حَوْلَ وَلَا قُوَّةَ إِلَّا بِاللَّهِ",
      "transliteration": "Bismillah, tawakkaltu 'ala Allah, wa la hawla wa la quwwata illa billah",
      "translation": "In the name of Allah, I place my trust in Allah, and there is no might nor power except with Allah",
      "reference": "Abu Dawud 5095, Tirmidhi 3426",
      "benefits": "Protection from harm, guidance, and sufficiency",
      "time": "When leaving home"
    },
    {
      "id": 65,
      "categoryId": 17,
      "title": "Dua Before Wudu",
      "arabic": "بِسْمِ اللَّهِ",
      "transliteration": "Bismillah",
      "translation": "In the name of Allah",
      "reference": "Abu Dawud 101, Ibn Majah 397",
      "benefits": "Wudu is not complete without saying Bismillah",
      "time": "Before starting wudu"
    },
    {
      "id": 66,
      "categoryId": 17,
      "title": "Dua After Wudu",
      "arabic": "أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ",
      "transliteration": "Ashhadu an la ilaha illa Allah wahdahu la sharika lah, wa ashhadu anna Muhammadan 'abduhu wa rasuluh",
      "translation": "I bear witness that there is no deity except Allah alone, without partner, and I bear witness that Muhammad is His slave and Messenger",
      "reference": "Muslim 234",
      "benefits": "The gates of Paradise are opened for the one who says this",
      "time": "After completing wudu"
    },
    {
      "id": 67,
      "categoryId": 17,
      "title": "Dua When Entering Toilet",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْخُبُثِ وَالْخَبَائِثِ",
      "transliteration": "Allahumma inni a'udhu bika min al-khubthi wal-khaba'ith",
      "translation": "O Allah, I seek refuge in You from male and female evil spirits",
      "reference": "Bukhari 142, Muslim 375",
      "benefits": "Protection from shaytan in the toilet",
      "time": "Before entering toilet"
    },
    {
      "id": 68,
      "categoryId": 17,
      "title": "Dua When Leaving Toilet",
      "arabic": "غُفْرَانَكَ",
      "transliteration": "Ghufranaka",
      "translation": "I seek Your forgiveness",
      "reference": "Abu Dawud 30, Tirmidhi 7, Ibn Majah 300",
      "benefits": "Seeking Allah's forgiveness after relieving oneself",
      "time": "After leaving toilet"
    },
    {
      "id": 69,
      "categoryId": 18,
      "title": "Dua When Entering Mosque",
      "arabic": "أَعُوذُ بِاللَّهِ الْعَظِيمِ، وَبِوَجْهِهِ الْكَرِيمِ، وَسُلْطَانِهِ الْقَدِيمِ، مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "transliteration": "A'udhu billahil-'Adhim, wa bi-Wajhihil-Karim, wa Sultanihil-Qadim, min ash-Shaytanir-Rajim",
      "translation": "I seek refuge in Allah the Almighty, in His Noble Face, and His Eternal Dominion, from Satan the accursed",
      "reference": "Abu Dawud 466",
      "benefits": "Protection from Shaytan when entering the mosque",
      "time": "When entering mosque"
    },
    {
      "id": 70,
      "categoryId": 18,
      "title": "Dua When Leaving Mosque",
      "arabic": "اللَّهُمَّ إِنِّي أَسْأَلُكَ مِنْ فَضْلِكَ",
      "transliteration": "Allahumma inni as'aluka min fadlik",
      "translation": "O Allah, I ask You from Your bounty",
      "reference": "Muslim 713",
      "benefits": "Asking for Allah's bounty and blessings",
      "time": "When leaving mosque"
    },
    {
      "id": 71,
      "categoryId": 19,
      "title": "Dua When It Rains",
      "arabic": "اللَّهُمَّ صَيِّبًا نَافِعًا",
      "transliteration": "Allahumma sayyiban nafi'a",
      "translation": "O Allah, (bring) beneficial rain",
      "reference": "Bukhari 1032",
      "benefits": "Asking for beneficial rain",
      "time": "When it rains"
    },
    {
      "id": 72,
      "categoryId": 19,
      "title": "Dua When Hearing Thunder",
      "arabic": "سُبْحَانَ الَّذِي يُسَبِّحُ الرَّعْدُ بِحَمْدِهِ وَالْمَلَائِكَةُ مِنْ خِيفَتِهِ",
      "transliteration": "Subhana alladhi yusabbihur-ra'du bihamdihi wal-mala'ikatu min khifatih",
      "translation": "Glory is to Him Whom thunder glorifies with His praise, and the angels too, out of fear of Him",
      "reference": "Muwatta Malik 3641",
      "benefits": "Protection from being struck by lightning",
      "time": "When hearing thunder"
    },
    {
      "id": 73,
      "categoryId": 19,
      "title": "Dua When Seeing New Moon",
      "arabic": "اللَّهُ أَكْبَرُ، اللَّهُمَّ أَهِلَّهُ عَلَيْنَا بِالْأَمْنِ وَالْإِيمَانِ، وَالسَّلَامَةِ وَالْإِسْلَامِ، رَبِّي وَرَبُّكَ اللَّهُ",
      "transliteration": "Allahu Akbar, Allahumma ahillahu 'alayna bil-amni wal-iman, was-salamati wal-Islam, rabbi wa rabbuka Allah",
      "translation": "Allah is the Greatest. O Allah, bring it over us with blessing and faith, and security and Islam. My Lord and your Lord is Allah",
      "reference": "Tirmidhi 3451",
      "benefits": "Blessings for the new month",
      "time": "When seeing new moon"
    },
    {
      "id": 74,
      "categoryId": 20,
      "title": "Dua for the Deceased",
      "arabic": "اللَّهُمَّ اغْفِرْ لَهُ وَارْحَمْهُ، وَعَافِهِ وَاعْفُ عَنْهُ",
      "transliteration": "Allahumma ighfir lahu warhamhu, wa 'afihi wa'fu 'anhu",
      "translation": "O Allah, forgive him and have mercy on him, and give him strength and pardon him",
      "reference": "Muslim 963",
      "benefits": "Mercy and forgiveness for the deceased",
      "time": "When praying for deceased"
    },
    {
      "id": 75,
      "categoryId": 20,
      "title": "Dua When Visiting Graves",
      "arabic": "السَّلَامُ عَلَيْكُمْ أَهْلَ الدِّيَارِ مِنَ الْمُؤْمِنِينَ وَالْمُسْلِمِينَ، وَإِنَّا إِنْ شَاءَ اللَّهُ بِكُمْ لَاحِقُونَ، نَسْأَلُ اللَّهَ لَنَا وَلَكُمُ الْعَافِيَةَ",
      "transliteration": "As-salamu 'alaykum ahla ad-diyari min al-mu'minina wal-muslimin, wa inna in sha' Allah bikum lahiqun, nas'alu Allaha lana wa lakum al-'afiyah",
      "translation": "Peace be upon you, O inhabitants of the dwellings, from among the believers and Muslims. Indeed, we will, if Allah wills, join you. We ask Allah for well-being for us and for you",
      "reference": "Muslim 974",
      "benefits": "Respect for the deceased and supplication for them",
      "time": "When visiting graves"
    },
    {
      "id": 76,
      "categoryId": 21,
      "title": "Dua for Newlyweds",
      "arabic": "بَارَكَ اللَّهُ لَكَ، وَبَارَكَ عَلَيْكَ، وَجَمَعَ بَيْنَكُمَا فِي خَيْرٍ",
      "transliteration": "Baraka Allahu laka, wa baraka 'alayka, wa jama'a baynakuma fi khayr",
      "translation": "May Allah bless you, and shower His blessings upon you, and join you together in goodness",
      "reference": "Abu Dawud 2130, Tirmidhi 1091",
      "benefits": "Blessings for the married couple",
      "time": "Congratulating newlyweds"
    },
    {
      "id": 77,
      "categoryId": 21,
      "title": "Dua Before Intimacy",
      "arabic": "بِسْمِ اللَّهِ، اللَّهُمَّ جَنِّبْنَا الشَّيْطَانَ، وَجَنِّبِ الشَّيْطَانَ مَا رَزَقْتَنَا",
      "transliteration": "Bismillah, Allahumma jannibna ash-Shaytan, wa jannib ash-Shaytana ma razaqtana",
      "translation": "In the name of Allah. O Allah, keep us away from Satan and keep Satan away from what You have bestowed upon us",
      "reference": "Bukhari 141, Muslim 1434",
      "benefits": "Protection for future children from Satan",
      "time": "Before intimacy"
    },
    {
      "id": 78,
      "categoryId": 21,
      "title": "Dua for Righteous Offspring",
      "arabic": "رَبِّ هَبْ لِي مِن لَّدُنكَ ذُرِّيَّةً طَيِّبَةً ۖ إِنَّكَ سَمِيعُ الدُّعَاءِ",
      "transliteration": "Rabbi hab li min ladunka dhurriyyatan tayyibatan innaka sami'u ad-du'a",
      "translation": "My Lord, grant me from Yourself a good offspring. Indeed, You are the Hearer of supplication",
      "reference": "Quran 3:38",
      "benefits": "Asking for righteous children",
      "time": "Anytime"
    },
    {
      "id": 79,
      "categoryId": 22,
      "title": "Dua When Angry",
      "arabic": "أَعُوذُ بِاللَّهِ مِنَ الشَّيْطَانِ الرَّجِيمِ",
      "transliteration": "A'udhu billahi min ash-Shaytanir-Rajim",
      "translation": "I seek refuge in Allah from Satan the accursed",
      "reference": "Bukhari 3282, Muslim 2610",
      "benefits": "Calming anger and seeking protection from Satan",
      "time": "When feeling angry"
    },
    {
      "id": 80,
      "categoryId": 22,
      "title": "Dua for Patience",
      "arabic": "رَبَّنَا أَفْرِغْ عَلَيْنَا صَبْرًا وَثَبِّتْ أَقْدَامَنَا",
      "transliteration": "Rabbana afrigh 'alayna sabran wa thabbit aqdamana",
      "translation": "Our Lord, pour upon us patience and plant firmly our feet",
      "reference": "Quran 2:250",
      "benefits": "Asking for patience and steadfastness",
      "time": "During trials"
    },
    {
      "id": 81,
      "categoryId": 23,
      "title": "Dua for Relief from Debt",
      "arabic": "اللَّهُمَّ اكْفِنِي بِحَلَالِكَ عَنْ حَرَامِكَ، وَأَغْنِنِي بِفَضْلِكَ عَمَّنْ سِوَاكَ",
      "transliteration": "Allahumma ikfini bihalalika 'an haramika, wa aghnini bifadlika 'amman siwak",
      "translation": "O Allah, make what is lawful enough for me, as opposed to what is unlawful, and spare me by Your grace, of need of others",
      "reference": "Tirmidhi 3563",
      "benefits": "Relief from debt and financial worry",
      "time": "When in debt"
    },
    {
      "id": 82,
      "categoryId": 23,
      "title": "Dua for Anxiety and Worry",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْهَمِّ وَالْحَزَنِ، وَالْعَجْزِ وَالْكَسَلِ، وَالْبُخْلِ وَالْجُبْنِ، وَضَلَعِ الدَّيْنِ، وَغَلَبَةِ الرِّجَالِ",
      "transliteration": "Allahumma inni a'udhu bika min al-hammi wal-hazan, wal-'ajzi wal-kasal, wal-bukhli wal-jubn, wa dala'i ad-dayn, wa ghalabati ar-rijal",
      "translation": "O Allah, I seek refuge in You from worry and grief, from helplessness and laziness, from cowardice and miserliness, and from being overcome by debt and overpowered by men",
      "reference": "Bukhari 6369",
      "benefits": "Protection from anxiety, debt, and being overpowered",
      "time": "When worried or anxious"
    },
    {
      "id": 83,
      "categoryId": 24,
      "title": "Talbiyah - Hajj Chant",
      "arabic": "لَبَّيْكَ اللَّهُمَّ لَبَّيْكَ، لَبَّيْكَ لَا شَرِيكَ لَكَ لَبَّيْكَ، إِنَّ الْحَمْدَ وَالنِّعْمَةَ لَكَ وَالْمُلْكَ، لَا شَرِيكَ لَكَ",
      "transliteration": "Labbayka Allahumma labbayk, labbayka la sharika laka labbayk, inna al-hamda wan-ni'mata laka wal-mulk, la sharika lak",
      "translation": "Here I am, O Allah, here I am. Here I am, You have no partner, here I am. Verily all praise, grace and sovereignty belong to You. You have no partner",
      "reference": "Bukhari 1549, Muslim 1184",
      "benefits": "The chant of pilgrims during Hajj and Umrah",
      "time": "During Hajj/Umrah"
    },
    {
      "id": 84,
      "categoryId": 24,
      "title": "Dua at Safa and Marwah",
      "arabic": "لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ، لَا إِلَهَ إِلَّا اللَّهُ وَحْدَهُ، أَنْجَزَ وَعْدَهُ، وَنَصَرَ عَبْدَهُ، وَهَزَمَ الْأَحْزَابَ وَحْدَهُ",
      "transliteration": "La ilaha illa Allah wahdahu la sharika lah, lahu al-mulku wa lahu al-hamd, wa huwa 'ala kulli shay'in qadir. La ilaha illa Allah wahdah, anjaza wa'dah, wa nasara 'abdah, wa hazama al-ahzaba wahdah",
      "translation": "There is no deity except Allah, alone, without partner. To Him belongs dominion and to Him belongs praise, and He is over all things competent. There is no deity except Allah alone. He fulfilled His promise, supported His servant, and defeated the confederates alone",
      "reference": "Muslim 1218",
      "benefits": "Dua at Safa and Marwah during Sa'i",
      "time": "At Safa and Marwah"
    },
    {
      "id": 85,
      "categoryId": 25,
      "title": "Dua for Good in This World and Hereafter",
      "arabic": "رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الْآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ",
      "transliteration": "Rabbana atina fid-dunya hasanatan wa fil-akhirati hasanatan wa qina 'adhaban-nar",
      "translation": "Our Lord, give us in this world [that which is] good and in the Hereafter [that which is] good and protect us from the punishment of the Fire",
      "reference": "Quran 2:201",
      "benefits": "Comprehensive dua for both worlds",
      "time": "Anytime"
    },
    {
      "id": 86,
      "categoryId": 25,
      "title": "Dua for Increase in Knowledge",
      "arabic": "رَبِّ زِدْنِي عِلْمًا",
      "transliteration": "Rabbi zidni 'ilma",
      "translation": "My Lord, increase me in knowledge",
      "reference": "Quran 20:114",
      "benefits": "Asking for increase in beneficial knowledge",
      "time": "Anytime"
    },
    {
      "id": 87,
      "categoryId": 25,
      "title": "Dua for Ease",
      "arabic": "رَبِّ يَسِّرْ وَلَا تُعَسِّرْ",
      "transliteration": "Rabbi yassir wa la tu'assir",
      "translation": "My Lord, make things easy and do not make them difficult",
      "reference": "Authentic Dua",
      "benefits": "Asking for ease in all matters",
      "time": "Anytime"
    },
    {
      "id": 88,
      "categoryId": 25,
      "title": "Comprehensive Dua for Protection",
      "arabic": "اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ جَهَنَّمَ، وَمِنْ عَذَابِ الْقَبْرِ، وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ، وَمِنْ شَرِّ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ",
      "transliteration": "Allahumma inni a'udhu bika min 'adhabi jahannam, wa min 'adhabil-qabr, wa min fitnatil-mahya wal-mamat, wa min sharri fitnatil-masihid-dajjal",
      "translation": "O Allah, I seek refuge in You from the punishment of Hell, from the punishment of the grave, from the trials of life and death, and from the evil of the trial of the False Messiah",
      "reference": "Bukhari 1377, Muslim 588",
      "benefits": "Comprehensive protection from major trials",
      "time": "After Tashahhud in prayer"
    },
    {
      "id": 89,
      "categoryId": 25,
      "title": "Dua for Acceptance of Deeds",
      "arabic": "رَبَّنَا تَقَبَّلْ مِنَّا ۖ إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ",
      "transliteration": "Rabbana taqabbal minna innaka anta as-Sami'ul-'Alim",
      "translation": "Our Lord, accept [this] from us. Indeed You are the Hearing, the Knowing",
      "reference": "Quran 2:127",
      "benefits": "Asking Allah to accept our deeds",
      "time": "After good deeds"
    }
  ]
}